MultiphaseCavBubbleFoam/exampleCases/emulsificationorg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1462;
        startFace       1163601;
    }
    wall
    {
        type            patch;
        nFaces          125;
        startFace       1165063;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          581732;
        startFace       1165188;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          581732;
        startFace       1746920;
    }
    outside
    {
        type            patch;
        nFaces          375;
        startFace       2328652;
    }
)

// ************************************************************************* //
