MultiphaseCavBubbleFoam/exampleCases/emulsificationorg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;
s -5; //negative sheet thickness
x 5;
y 5;

vertices
(
    (0  $s -0.000016)
    ($x $s -0.016016)
    (0  $y -0.000016)
    ($x $y -0.016016)
    
    (0  $s 0.000016)
    ($x $s 0.016016)
    (0  $y 0.000016)
    ($x $y 0.016016)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (125 250 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type symmetryPlane;
        faces
        (
            (0 2 6 4)
        );
    }
    wall
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
    	type wedge;
    	faces
    	(
            (0 1 3 2)
    	);
    }
    back
    {
    	type wedge;
    	faces
    	(
            (4 5 7 6)
    	);
    }
    outside
    {
        type patch;
        faces
        (
            (1 3 7 5)
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
